label goodEnding:
    # 배경: 마당

    나 "나는 말없이 엘리를 안아주었다."
    나 "엘리가 기쁨으로 몸을 파르르 떠는 것이 느껴졌다."

    # 엘리 (음영 on, 놀람, 사백안, 미소, 눈물)
    엘리 "아, 아아아."

    # 엘리 (음영 on, 놀람, 사백안, 큰 웃음, 눈물)
    엘리 "기뻐요, 너무 기뻐요. 너무 기쁘면 이렇게 숨이 막히기도 하는 걸까요."
    엘리 "상관없어요. 마침내 당신도 제 진심을 알아주신…."

    나 "그리고 나는 엘리의 오른손을 들어 나의 가슴팍에 올렸다."

    # 엘리 (음영 on, 놀람, 사백안, 무표정)
    엘리 "…."

    # 엘리 (음영 off, 기쁨, 실눈 웃음, 미소)
    엘리 "…왜 갑자기 본인의 깊게 패인 상처를 제게 대시는 건지?"

    # ‘나’ 
    난설 "나는 이 부분이 상처라고는 한마디도 안 했어."

    # 엘리 (음영 on, 놀람, 사백안, 무표정, 눈물)
    엘리 "……."
    엘리 "아뇨, 분명 상처예요. 장신구나 옷 같은 걸로 얼버무릴 생각 마세요."
    엘리 "누가 찌르기라도 한 게 아닌 이상…."
    엘리 "아."

    # 배경: 마당, 블러

    나 "이제야 또렷이 기억난다. "
    나 "내가 실랑이를 벌일 때, 엘리가 내 가슴을 칼로 찔렀다는 것을."

    # 배경: 검은 화면, 칼, 피 이펙트

    나 "나를 일종의 지박령으로 만들어 자신처럼 저택에 묶어둘 심산으로 말이다."

    # 배경: 마당, 블러
    # 엘리 (음영 on, 놀람, 사백안, 무표정, 눈물 – 오열)

    나 "내가 살살 나의 상흔을 문지르는 동시에, 엘리가 눈물을 뚝, 뚝 흘리는 것이 보였다."

    # 엘리 (음영 on, 놀람, 사백안, 무표정, 눈물 – 오열)
    엘리 "아, 아니에요."
    엘리 "오해예요. 전부 오해라고요. 전 그저."

    # ‘나’ 
    난설 "이제 알아, 나는 죽었지? 그야 이렇게 깊게 찔렸는걸."

    # 엘리 (음영 on, 놀람, 사백안, 무표정, 눈물 – 오열)
    엘리 "그렇지만 함께 있으려면 그 방법밖엔 없었다고요!"

    나 "석양을 등진 채로, 나는 바닥에 주저앉아 엉엉 우는 엘리를 가만히 지켜보았다."
    나 "어린아이처럼 울고 있는 엘리를 보다 보니 이상야릇한 기분이 들었다."
    나 "무엇이라고 표현해야 할까, 당연히 들어야만 하는 배신감, 혹은 모멸감?"
    나 "그것보다는 오히려 상쾌했다 - 들판의 잔디를 가로지르는 시원한 산들바람처럼."
    나 "고독에 미쳐버린 소녀에게 벌을 주고 싶은 마음보다, 모든 진실을 알고 난 후의 상쾌함이 더 컸다고 하면 이상하게 들릴까."

    # 엘리 (음영 off, 놀람, 사백안, 무표정, 눈물 – 오열)
    엘리 "저 때문이에요, 잊히고 싶지 않았어요. 잘못했어요. 그런데, 그런데. 아아."

    나 "무엇보다, 그걸 고민한들 무슨 소용이 있을까."
    나 "엘리를 다시 한번 안아주었다. 몸이 날개처럼 가벼워지는 것이 느껴졌다."
    나 "몸이, 영혼이 수많은 가루가 되어 내가 도달해야 할 곳으로 날아가고 있었다."
    나 "나도, 엘리도, 마지막을 장식하기 전 서로를 강하게 끌어안고 있었다."

    # 엘리 (음영 off, 놀람, 웃음, 미소, 눈물 – 오열)
    엘리 "…죄송해요, 정말로 죄송해요."
    엘리 "둘만의 영원한 행복을 생각했던 저의 짧고 덧없는 바람 때문에 이런 일이."
    엘리 "원망하셔도 상관없지만, 고마워요, 마지막까지 이렇게, 절 바라봐 주셔서."

    나 "한없이 가벼워진다."
    나 "엘리의 눈물을 닦아주고 싶은데, 이젠 그것도 힘들 것 같다."

    # 배경: 파란색 하늘

    엘리 "그럼, 소녀의 마지막 어리광으로,"
    엘리 "부디 마지막으로, 하나만 부탁드려도 될까요?"

    # 텍스트 입력 창 등장 : 

    $ renpy.input("“당신의 이름을 알려주세요.”")

    # 플레이어가 이름을 입력한 뒤 타이틀 화면으로 복귀, 타이틀 CG에 엘리 대신 파랗고 쾌청한 하늘이 나타남

    return