label trueEnding:
    나 "내가 네 멱살을 쥐려고 들 때, 나는 대답했다."

    # 엘리 (음영 on, 놀람, 웃음, 미소)
    엘리 "아아, 그렇군요."

    # 엘리 (음영 on, 보통, 실눈 웃음, 미소, 눈물)
    엘리 "…다행이에요. 정말 다행이야."

    나 "영문 모를 반응의 엘리."
    나 "이해가 가지 않는다. 나를 이 저택에 잡아두려는 게 아니었나?"

    # 엘리 (음영 off, 놀람, 실눈 웃음, 미소)
    엘리 "그럼요, 실은 이번엔 저도 당신을 돕고 싶었답니다."

    # 엘리 (음영 off, 행복, 웃음, 미소)
    엘리 "그땐 고집을 조금 부렸지만, 결국 {i}no place like home{/i}, 집만한 곳은 없잖아요?"

    # 엘리 (음영 off, 행복, 웃음, 미소)
    엘리 "거짓말 아니랍니다, 제 가족들처럼, 몸이 조각상이 되는 불상사는 없을 거예요."

    # 배경: 조각상

    나 "떨떠름한 채로 엘리와 악수를 나눈 뒤, 그대로 조각상들이 있는 곳을 향했다."
    나 "엘리의 말대로 몸이 굳어 돌이 되지는 않았다."

    # 배경: 숲길 입구, 텍스트가 나올 때마다 어둡고 흐릿해짐

    나 "저만치에 울창한 나무들이 겹쳐 만들어진 길이 나타났다."
    나 "심히 불길했지만, 저곳 외에는 나가는 길이 보이지 않았다."
    나 "갑자기 피로가 몰려오는 몸을 이끌고 어두운 숲 속으로 들어갔다."
    나 "나뭇잎 밟히는 소리가 귀를 간질였다."
    나 "몸이 너무나도 무거웠다, 같은 길을 빙빙 도는 느낌, 이 길이 맞기는 한 걸까."
    나 "그럴 일은 절대 없겠지만, 다시 저택으로 돌아가기에도 너무나 멀리 와 버렸다."
    나 "한치 앞도 보이지 않는 풀숲 위에 쓰러지며 나는 물었다."

    # 배경: 검은색 배경

    나 "내가 누구였지?"

    # 배경: 살구색 배경

    # 배경: 저택, 빛바랜 필터

    "…경애하는 그대에게,"
    "이 말을 듣지는 못하시겠지만, 꼭 전하고 싶었어요."
    "말썽꾸러기에 거짓말쟁이라 정말 미안했다고요."
    "석양을 가리는 구름이 떨리고, 수풀이 떨리는 기척이 느껴질 때마다 알 수 있었어요. 저와 이 저택에 관한 이야기가 몇몇 이들에 의해 세상에 퍼진 지 꽤 되었고."
    "일부는 직접 찾아오기도 했으며, 특별히 멍청한 이들은 돌이 되어버렸다는 걸요."
    "그러거나 말거나 신경도 쓰지 않았답니다. 희망은 진즉에 버린 지 오래였으니."
    "저는 금방 잊히고 말 시시한 괴담 속 유령이자, 이야기의 부속품이죠."
    "희뿌연 제 기억과 함께 곧 잊히고 말 저한테 누가 신경이나 쓰겠어요."

    # 배경: 비 내리는 창문
    "60년 만에 처음으로 저택에 비가 내리던 그 날을 제외하고 말이에요."
    "제 앞에서 억지로 미소 짓는, 금방이라도 무너질 듯한 당신의 두 눈을 보았을 때."
    "모든 것이 흐려진 제 마음에 무언가 다시 피어나는 것을 느꼈어요."
    "낡고 해진 종이 위로, 다시 펜을 들어 이야기를 써 내려가기 시작한 거예요."

    #배경: 서재
    "제가 처음에 툴툴댔던 거, 기억나요?"
    "너무 오랜만에 어리광을 부리다 보니 익숙하지 않기도 했지만, 일부러 모질게 군 것도 없잖아 있었어요."
    "정원에 핀 꽃들이 아침 햇살을 향해 목을 뻗듯, 당신의 온화함에 몸과 마음을 모두 내어줄까 봐."
    "당신이 다가올 때마다 저는 제가 꺾이기라도 할 듯 가시를 세웠어요."

    #배경: 정원에 핀 꽃
    "그래요, 저는 진즉에 알고 있었는지도 몰라요."
    "언젠가 당신이 절 떠날 순간이 온다는 사실을 말이에요."
    "그렇게 되면 전 다시 홀로 남겨지고, 제 남은 기억과 존재 모두 잊히고 말겠죠."
    "사라지는 것과 다름없는 일이겠죠."
    "그게 너무나도 두려웠어요. 너무나."

    # 배경: 응접실
    # 엘리 (음영 on, 사백안, 웃음, 미소)
    엘리 "…그래서 일부러 당신을 죽였어요."
    엘리 "육체는 돌이 될지언정, 영혼은 이곳에 남아 떠돌 수 있게 말이에요."
    엘리 "이곳에 오래 살다 보니, 기억을 되살리진 못해도 어느 정도 잠재우는 법도 알아냈고 말이죠."
    엘리 "다시 잠드시는 거예요, 영원히 행복한, 둘만의 꿈속으로."

    # 효과음: 노크 소리와 끼이익- 하는 문소리

    # 엘리 (음영 off, 행복, 웃음, 미소)
    엘리 "아, 마침 다시 오셨나 봐요."

    # 엘리 (음영 off, 행복, 실눈 웃음, 미소)
    엘리 "늘상 똑같지만, 가장 기대되는 순간도 언제나 지금이라니까요."

    # 배경: 검은 화면

    # 엘리 (scg x)
    엘리 "당신도, 그렇죠?"

    # 타이틀 화면으로 복귀

    return